INSERT INTO genre (genre_name) 
VALUES ('Поп-музыка'), ('Классическая'), ('Рок'), ('Рэп'), ('Джаз'), ('Шансон');

INSERT INTO artist (artist_name) 
VALUES ('Михаил Шуфутинский'), ('Любовь Успенская'), ('Луи Армстронг'), ('Вольфганг Амадей Моцарт'), 
       ('Антонио Сальери'), ('Баста'), ('Клава Кока'), ('Артур Пирожков'), ('Элждей');

INSERT INTO album (album_name, year_of_release) 
VALUES ('Альфа', 2018), ('Бэта', 2022), ('Гамма', 2018), ('Дельта', 1995), ('Эпсилон', 1999), ('Дзэта', 2015), ('Эта', 2010), ('Тэта', 2017);

INSERT INTO track (album_id, track_name, track_duration) 
VALUES (1, 'Люба-Любонька', '2:15'), (1, 'Третье сентября', '5:06'), (2, 'К единстывенному нежному', '4:10'), (3, 'Hello, Dolly', '5:32'), 
       (4, 'Реквием', '10:50'), (4, 'Симфония №40', '15:30'), (4, 'Тарара', '45:00'), (5, 'С надеждой на крылья', '4:44'), 
       (5, 'Вселенная', '5:01'), (6, 'Покинула чат', '03:15'), (6, 'Хочешь', '2:33'), (6, 'Перетанцуй меня', '3:55'), 
       (6, 'Как Челентано', '3:33'), (7, 'Розовое вино', '3:44'), (8, 'Рваные джинсы', '6:12'), (1, 'Мой самый', '1:19'); 

INSERT INTO collection (collection_name, year_of_release) 
VALUES ('Шансончик', 2018), ('Джаз и классика', 2000), ('Итальянский симфонический оркестр', 2015), ('Любитетям хип-хопа', 2022), 
       ('Попсовые дуэты', 2017), ('Просто попса', 2019), ('Классика', 2019), ('Баста. Лучшее', 2020);

INSERT INTO artist_genre (genre_id, artist_id) 
VALUES (6, 1), (6, 2), (5, 3), (2, 4), (2, 5), (4, 6), (1, 7), (1, 8), (4, 9);

INSERT INTO artist_album (album_id, artist_id) 
VALUES (1, 1), (2, 2), (3, 3), (4, 4), (4, 5), (5, 6), (6, 7), (7, 8), (8, 9);

INSERT INTO collection_track (track_id, collection_id) 
VALUES (1, 1), (16, 1), (4, 2), (5, 2), (6, 3), (7, 4), (11, 5), (10, 6), (12, 6), (5, 7), (6, 7), (7, 7), (9, 8);
